benchmark-results/gateway-benchmark-20260903T123358Z-49313/direct-1024-measured-c256.stdout.txt
Running 30s test @ http://127.0.0.1:9001/bytes/1024
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.96ms    3.77ms  45.47ms   84.97%
    Req/Sec    37.91k    19.09k   63.24k    56.19%
  Latency Distribution
     50%  593.00us
     75%    4.96ms
     90%    8.27ms
     99%   10.69ms
  4536163 requests in 30.10s, 4.77GB read
Requests/sec: 150702.32
Transfer/sec:    162.26MB